# Дано целое число N (>0). Найти сумму 1 + 1/2 + 1/3 + ... + 1/N

N = int(input("Введите целое число : "))

a = 0
c = 0

while a < N:
    a += 1
    c += 1 / a
print("Сумма: ", c)