#Даны строки S, S1 и S2. Заменить в строке S последнее вхождение строки S1 на строку S2.

s = input("Введите строку:\n")

s1 = input("Введите подстроку для поиска:\n")

s2 = input("Введите подстроку для замены:\n")

t = s.rfind(s1)

s = s[:t] + s2 + s [t+len(s1):]

print(s)