# Дана строка '2020год -16 -10 -6 4 20 32 36 32 32 15 1 -15',
# отражающая средние температуры по месяцам в году. Преобразовать информацию из строки в
# словарь, с использованием функции найти среднюю и минимальные температуры,
# результаты вывести на экран.

def poisk():
    slog = 0
    col = 0
    for i in s:
        slog += int(i)
        col += 1
    c = slog // col
    print("Средняя температруа : ", c)

    o = []
    for i in s:
        o.append(int(i))
    print("Минимальная температура : ", min(o))


pogoda = {}
s = '2020год  -16 -10 -6 4 20 32 36 32 32 15 1 -15'
s = s.split()[1:]


pogoda['Январь'] = s[0]
pogoda['Февраль'] = s[1]
pogoda['Март'] = s[2]
pogoda['Апрель'] = s[3]
pogoda['Май'] = s[4]
pogoda['Июнь'] = s[5]
pogoda['Июль'] = s[6]
pogoda['Август'] = s[7]
pogoda['Сентябрь'] = s[8]
pogoda['Октябрь'] = s[9]
pogoda['Ноябрь'] = s[10]
pogoda['Декабрь'] = s[11]
print(pogoda)
print(poisk())
