# Описать функцию DigitCountSum(K, C, S), находящую кол-во С цифр целого положительного числа K, а так же сумму S
# (K- входной, C и К входные параметры целого типа).
# С помощъю этой функции найти кол-во и сумму уифр для каждого из пяти данных целых чисел.

# c делит (считает сколько цифр)
# s складывает полчившееся(после деления)

k = int(input("Введите число: "))

def DigitCountSum(k):
    c = 0
    s = 0
    sum = 0
    while k > 0:
        c += 1
        sum += k % 10
        k //= 10
    return c, sum

print(DigitCountSum(k))